import numpy as np


T_to_unitree_left_wrist = np.array([[1, 0, 0, 0],
                                    [0, 0, -1, 0],
                                    [0, 1, 0, 0],
                                    [0, 0, 0, 1]])

T_to_unitree_right_wrist = np.array([[1, 0, 0, 0],
                                     [0, 0, 1, 0],
                                     [0, -1, 0, 0],
                                     [0, 0, 0, 1]])

T_to_unitree_hand = np.array([[0, 0, 1, 0],
                              [-1,0, 0, 0],
                              [0, -1,0, 0],
                              [0, 0, 0, 1]])

T_robot_openxr = np.array([[0, 0, -1, 0],
                           [-1, 0, 0, 0],
                           [0, 1, 0, 0],
                           [0, 0, 0, 1]])
# T_robot_openxr = np.array([[1,  0,  0, 0],   # x stays x
#                            [0,  0, -1, 0],   # y -> -z
#                            [0,  1,  0, 0],   # z -> y
#                            [0,  0,  0, 1]])

ROT_ADJUST = np.array([      # VR到机械臂的轴向修正
    [1, 0, 0, 0],
    [0, 0, -1, 0],
    [0, 1, 0, 0],
    [0, 0, 0, 1]
])

const_head_vuer_mat = np.array([[1, 0, 0, 0],
                                [0, 1, 0, 1.5],
                                [0, 0, 1, -0.2],
                                [0, 0, 0, 1]])


# For G1 initial position
const_right_wrist_vuer_mat = np.array([
    [1, 0, 0, 0.25],  
    [0, 1, 0, 1.5],  
    [0, 0, 1, -0.4],  
    [0, 0, 0, 1.00]
])
# For G1 initial position
const_left_wrist_vuer_mat = np.array([[1, 0, 0, -0.15],
                                      [0, 1, 0, 1.13],
                                      [0, 0, 1, -0.3],
                                      [0, 0, 0, 1]])
import numpy as np

const_ee_vuer_mat = np.array([
    [1, 0, 0, 0.25],  
    [0, 1, 0, 1.5],  
    [0, 0, 1, -0.4],  
    [0, 0, 0, 1.00]
])

R = np.array([[ 0.      , -0.61742 ,  0.78664 ],
 [ 1.      ,  0.      ,  0.      ],
 [ 0.      ,  0.78664 ,  0.61742 ]])


#######计算平移矫正矩阵,只是做了平移（光是平移好像不太行）
T_align = np.array([[-0.81632653,  0.48979592,  0.30612245, -0.28571429],
       [ 0.08443068, -0.42311557,  0.9021334 ,  0.70522234],
       [ 0.57138643,  0.76228155,  0.30404667, -0.70582324],
       [ 0.        ,  0.        ,  0.        ,  1.        ]])


T_webxr_to_robot = np.array([[-1,   0,   0,   0.25],
            [ 0,  -1,   0,   1.1 ],
            [ 0,   0,   1,   0.9 ],
            [ 0,   0,   0,   1.  ]])
# legacy
# const_right_wrist_vuer_mat = np.array([[1, 0, 0, 0.5],
#                                        [0, 1, 0, 1],
#                                        [0, 0, 1, -0.5],
#                                        [0, 0, 0, 1]])

# const_left_wrist_vuer_mat = np.array([[1, 0, 0, -0.5],
#                                       [0, 1, 0, 1],
#                                       [0, 0, 1, -0.5],
#                                       [0, 0, 0, 1]])
